app/controllers/deposits_controller.rb

    def create
        tradeline = Tradeline.find(deposit_create[:tradeline_id])
        trade_value = tradeline.amount
        if (trade_value - deposit_create[:amount]) <= 0
            render json: "Not enough balance in tradeline", status: 404
        else
            deposit = Deposit.create(deposit_create)
            trade_value -= deposit.amount
            tradeline.amount = trade_value
            tradeline.save
---
SELECT "tradelines".* FROM "tradelines" WHERE "tradelines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "deposits" ("amount", "deposit_date", "tradeline_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["amount", 1000], ["deposit_date", "1/1/1"], ["tradeline_id", 1], ["created_at", "2024-03-22 01:09:37.092785"], ["updated_at", "2024-03-22 01:09:37.092785"]]
UPDATE "tradelines" SET "amount" = ?, "updated_at" = ? WHERE "tradelines"."id" = ?  [["amount", 2223.54], ["updated_at", "2024-03-22 01:27:03.017290"], ["id", 1]]

    def index
        tradeline = Tradeline.find(params[:id])
---
SELECT "tradelines".* FROM "tradelines" WHERE "tradelines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]